driver-tests/bpelse/misc/MiscJbi/test/reverseString/Input.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
  <SOAP-ENV:Body>
    <reverseStringList xmlns="urn:sbyn:soapArrayTest" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
        <a1 xsi:type="xsd:int">2</a1>
        <stringsIn xsi:type="ArrayOfString" xmlns="urn:sbyn:soapArrayTest" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" soapenc:arrayType="xsd:string[3]"> 
            <item xsi:type="xsd:string">a</item>
            <item xsi:type="xsd:string">b</item>
            <item xsi:type="xsd:string">c</item>
        </stringsIn>
    </reverseStringList>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>